app/controllers/stocks_controller.rb

SELECT "bearers".* FROM "bearers"
---
  def index
    @stocks = Stock.includes(:bearer, :market_price)

UPDATE "stocks" SET "market_price_id" = ?, "updated_at" = ? WHERE "stocks"."id" = ?  [["market_price_id", 2], ["updated_at", "2018-04-25 12:16:38.563892"], ["id", 1]]
---
  def update
    if @stock.update(stock_params)

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."deleted_at" IS NULL AND "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_stock
    @stock = Stock.find params[:id]