app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."deleted_at" IS NULL
---
  def index
    @stocks = Stock.includes(:bearer, :market_price)

INSERT INTO "stocks" ("name", "bearer_id", "market_price_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ABC Company"], ["bearer_id", 1], ["market_price_id", 1], ["created_at", "2018-05-04 14:46:12.180567"], ["updated_at", "2018-05-04 14:46:12.180567"]]
---
  def create
    unless stock_params.values.include? "invalid"
      @stock = Stock.new stock_params
      if @stock.save!